import 'package:flutter/material.dart';

class Product {
  int id;
  String title;
  String text;
  String imageurl123;

  Product(int id1,String title, String text, String imageurl123 ) {
     id = id1;
    String title = "sdf";
    String text = "sdd";
    String imageurl123 = "dcdc";
  }


  Product.dddd(String i){

  String title = "dfdf";


}

}


//
//  var products =[
//Product(
//      id:1,
//    title: 'Краткие ответы на большие вопросы" Стивен Хокинг',
//    text: '''''Стивен Хокинг, величайший ученый современности, изменил наш мир. Его уход – огромная потеря для человечества. В своей финальной книге, над которой Стивен Хокинг работал практически до самого конца, великий физик делится с нами своим отношением к жизни, цивилизации, времени, Богу, к глобальным вещам, волнующим каждого из нас
//Перед вами книга-сенсация, книга-завещание, последний труд всемирно известного физика Стивена Хокинга, в которой он подводит некий итог и высказывается по самым главным вопросам, волнующим всех.
//
//Выживет ли человечество? Должны ли мы так активно внедряться в космос? Есть ли Бог? Это лишь некоторые из вопросов, на которые отвечает Стивен Хокинг, один из величайших умов в истории, в своей финальной книге.
//
//В книгу включены воспоминания оскароносца Эдди Редмэйна, игравшего Стивена Хокинга, Нобелевского лауреата Кипа Торна и дочери Хокинга, Люси.''',
//  imageurl123: 'https://cdn.book24.ru/v2/ITD000000000943518/COVER/cover3d1__w337.webp'
//
//),
//    Product(
//        id:2,
//        title: 'Краткие ответы на большие вопросы" Стивен Хокинг',
//        text: '''''Стивен Хокинг, величайший ученый современности, изменил наш мир. Его уход – огромная потеря для человечества. В своей финальной книге, над которой Стивен Хокинг работал практически до самого конца, великий физик делится с нами своим отношением к жизни, цивилизации, времени, Богу, к глобальным вещам, волнующим каждого из нас
//Перед вами книга-сенсация, книга-завещание, последний труд всемирно известного физика Стивена Хокинга, в которой он подводит некий итог и высказывается по самым главным вопросам, волнующим всех.
//
//Выживет ли человечество? Должны ли мы так активно внедряться в космос? Есть ли Бог? Это лишь некоторые из вопросов, на которые отвечает Стивен Хокинг, один из величайших умов в истории, в своей финальной книге.
//
//В книгу включены воспоминания оскароносца Эдди Редмэйна, игравшего Стивена Хокинга, Нобелевского лауреата Кипа Торна и дочери Хокинга, Люси.''',
//        imageurl123: 'https://cdn.book24.ru/v2/ITD000000000943518/COVER/cover3d1__w337.webp'
//
//    ),
//    Product(
//        id:3,
//        title: 'Краткие ответы на большие вопросы" Стивен Хокинг',
//        text: '''''Стивен Хокинг, величайший ученый современности, изменил наш мир. Его уход – огромная потеря для человечества. В своей финальной книге, над которой Стивен Хокинг работал практически до самого конца, великий физик делится с нами своим отношением к жизни, цивилизации, времени, Богу, к глобальным вещам, волнующим каждого из нас
//Перед вами книга-сенсация, книга-завещание, последний труд всемирно известного физика Стивена Хокинга, в которой он подводит некий итог и высказывается по самым главным вопросам, волнующим всех.
//
//Выживет ли человечество? Должны ли мы так активно внедряться в космос? Есть ли Бог? Это лишь некоторые из вопросов, на которые отвечает Стивен Хокинг, один из величайших умов в истории, в своей финальной книге.
//
//В книгу включены воспоминания оскароносца Эдди Редмэйна, игравшего Стивена Хокинга, Нобелевского лауреата Кипа Торна и дочери Хокинга, Люси.''',
//        imageurl123: 'https://cdn.book24.ru/v2/ITD000000000943518/COVER/cover3d1__w337.webp'
//
//    )
//  ];
////  List<Product> get product =>[...products];
////String getimageurl123(){
////  return "sdfsfsf";
////}